app/Models/Compte.php

    public function getSoldeAttribute()
    {
        $depot = $this->transactions()->where('type', 'depot')->sum('montant');
        $retrait = $this->transactions()->where('type', 'retrait')->sum('montant');
---
select sum("montant") as aggregate from "transactions" where "transactions"."compte_id" = 1 and "transactions"."compte_id" is not null and "type" = 'depot'
select sum("montant") as aggregate from "transactions" where "transactions"."compte_id" = 1 and "transactions"."compte_id" is not null and "type" = 'retrait'